index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-12-12 Di 03:54 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Knowledge Base</title>
<meta name="author" content="[[https://gitlab.informatik.uni-bremen.de/fdrees][Felix Drees]]" />
<meta name="keywords" content="cs math" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Knowledge Base
<br />
<span class="subtitle">computer science bachelor</span>
</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org469facc">1. Mathematik</a></li>
<li><a href="#org8adde0b">2. Praktische Informatik</a></li>
<li><a href="#org9ae8a27">3. Technische Informatik</a></li>
<li><a href="#org440a806">4. Theoretische Informatik</a></li>
</ul>
</div>
</div>
<blockquote>
<p>
The Documentation (either in its HTML format or in its Org-Mode format) is licensed under the <a href="https://www.gnu.org/licenses/fdl-1.3.txt">GNU Free Documentation License version 1.3</a> or later.
The code examples are licensed under the <a href="https://www.gnu.org/licenses/gpl-3.0.txt">GNU General Public License v3</a> or later.
</p>
</blockquote>

<ul class="org-ul">
<li>GitHub Page: todo &#x2026;</li>
<li>GitHub Repo: <a href="https://github.com/felixbd/knowledge-base">https://github.com/felixbd/knowledge-base</a></li>
</ul>


<div id="outline-container-org469facc" class="outline-2">
<h2 id="org469facc"><span class="section-number-2">1.</span> <a href="./ma/index.html">Mathematik</a></h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Mathematik 1: Logik, Kombinatorik und Lineare Algebra</li>
<li>Mathematik 2: Analysis</li>
<li>Mathematik 3: Stochastik und Statistik</li>
</ul>
</div>
</div>


<div id="outline-container-org8adde0b" class="outline-2">
<h2 id="org8adde0b"><span class="section-number-2">2.</span> <a href="./pi">Praktische Informatik</a></h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Praktische Informatik 1: Imperative Programmierung und Objektorientierung</li>
<li>Praktische Informatik 2: Algorithmen und Datenstrukturen</li>
<li>Praktische Informatik 3: Funktionale Programmierung</li>
</ul>
</div>
</div>


<div id="outline-container-org9ae8a27" class="outline-2">
<h2 id="org9ae8a27"><span class="section-number-2">3.</span> <a href="./tech">Technische Informatik</a></h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>Technische Informatik 1: Rechnerarchitektur und digitale Schaltungen</li>
<li>Technische Informatik 2: Betriebssysteme und Nebenläufigkeit</li>
</ul>
</div>
</div>


<div id="outline-container-org440a806" class="outline-2">
<h2 id="org440a806"><span class="section-number-2">4.</span> <a href="./theo">Theoretische Informatik</a></h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>Theoretische Informatik 1
<ul class="org-ul">
<li>Algorithmentheorie</li>
<li>Automaten und formale Sprachen</li>
</ul></li>
<li>Theoretische Informatik 2: Berechenbarkeitsmodelle und Komplexität</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: <a href="https://gitlab.informatik.uni-bremen.de/fdrees">Felix Drees</a></p>
<p class="date">Created: 2023-12-12 Di 03:54</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
